project/app/views/marques/show.html.erb

SELECT "voitures".* FROM "voitures" WHERE "voitures"."marque_id" = ?  [["marque_id", 12]]
---
  <ul>
  <% @marque.voitures.each do |voiture| %>