project/lib/tasks/import_voiture.rb

SELECT "marques".* FROM "marques" WHERE "marques"."libelle" = ? ORDER BY "marques"."id" ASC LIMIT ?  [["libelle", "Citroën"], ["LIMIT", 1]]
---


h["voitures"].each do |voiture|
    marque = Marque.where(libelle: voiture["marque"]["nom"]).first

INSERT INTO "marques" ("libelle", "created_at", "updated_at") VALUES (?, ?, ?)  [["libelle", "Citroën"], ["created_at", "2020-02-11 17:30:54.031339"], ["updated_at", "2020-02-11 17:30:54.031339"]]
---
        # marque = Marque.new
        # marque.libelle = voiture["marque"]["nom"]
        # marque.save
        marque = Marque.create!(libelle: voiture["marque"]["nom"])

INSERT INTO "voitures" ("immatriculation", "couleur", "created_at", "updated_at", "marque_id") VALUES (?, ?, ?, ?, ?)  [["immatriculation", "GP-413-MM"], ["couleur", "Rose"], ["created_at", "2020-02-11 17:32:26.138262"], ["updated_at", "2020-02-11 17:32:26.138262"], ["marque_id", 14]]
---
    ma_voiture.modele =  voiture["modele"]
    # ma_voiture.date_mise_en_service = voiture["created_at"]
    ma_voiture.marque_id = marque.id
    ma_voiture.save!