project/app/controllers/marques_controller.rb

  def index
    @marques = Marque.all
---
SELECT "marques".* FROM "marques"

  def show
    @marque = Marque.find(params[:id])
---
SELECT "marques".* FROM "marques" WHERE "marques"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def create
    @marque = Marque.new(marque_params)

    respond_to do |format|
      if @marque.save
---
INSERT INTO "marques" ("libelle", "created_at", "updated_at") VALUES (?, ?, ?)  [["libelle", "Pint"], ["created_at", "2020-02-04 16:26:33.187886"], ["updated_at", "2020-02-04 16:26:33.187886"]]

  def update
    respond_to do |format|
      if @marque.update(marque_params)
---
UPDATE "marques" SET "libelle" = ?, "updated_at" = ? WHERE "marques"."id" = ?  [["libelle", "Lada"], ["updated_at", "2020-02-04 16:26:40.800969"], ["id", 1]]

    def set_marque
      @marque = Marque.find(params[:id])
---
SELECT "marques".* FROM "marques" WHERE "marques"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]