project/app/controllers/personnes_controller.rb

SELECT "personnes".* FROM "personnes"
---
  def index
    @personnes = Personne.all

INSERT INTO "personnes" ("noms", "prenom", "date_naissance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["noms", "DUPONT"], ["prenom", "Bob"], ["date_naissance", "26/12/1970"], ["created_at", "2020-01-28 16:36:58.661598"], ["updated_at", "2020-01-28 16:36:58.661598"]]
---
  def create
    @personne = Personne.new(personne_params)

    respond_to do |format|
      if @personne.save

UPDATE "personnes" SET "date_naissance" = ?, "updated_at" = ? WHERE "personnes"."id" = ?  [["date_naissance", "2015-01-28"], ["updated_at", "2020-01-28 16:57:42.997779"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @personne.update(personne_params)

SELECT "personnes".* FROM "personnes" WHERE "personnes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_personne
      @personne = Personne.find(params[:id])