project/app/controllers/voitures_controller.rb

  def index
    @voitures = Voiture.all
---
SELECT "voitures".* FROM "voitures"

  def create
    @voiture = Voiture.new(voiture_params)

    respond_to do |format|
      if @voiture.save
---
INSERT INTO "voitures" ("immatriculation", "couleur", "modele", "date_mise_en_service", "created_at", "updated_at", "marque_id", "personne_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @voiture.update(voiture_params)
---
UPDATE "voitures" SET "modele" = ?, "marque_id" = ?, "personne_id" = ?, "updated_at" = ? WHERE "voitures"."id" = ?  [["modele", "lol"], ["marque_id", 12], ["personne_id", 3], ["updated_at", "2020-02-10 17:59:32.262297"], ["id", 3]]

  def destroy
    @voiture.destroy
---
DELETE FROM "voitures" WHERE "voitures"."id" = ?  [["id", 10]]

    def set_voiture
      @voiture = Voiture.find(params[:imat])
---
SELECT "voitures".* FROM "voitures" WHERE "voitures"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]