project/app/views/voitures/_form.html.erb

SELECT "marques".* FROM "marques" ORDER BY libelle
---
  <%= form.label :marque %>
    <%= form.collection_select :marque_id, Marque.order("libelle").all, :id, :libelle %>

SELECT "personnes".* FROM "personnes" ORDER BY noms
---
    <%= form.label :personne %>
    <%= form.collection_select :personne_id, Personne.order("noms").all, :id, :noms %>