project/app/views/personnes/show.html.erb

SELECT "voitures".* FROM "voitures" WHERE "voitures"."personne_id" = ?  [["personne_id", 4]]
---
  <ul>
  <% @personne.voitures.each do |voiture| %>